#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.pubsub_repo_amqp.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-amqp"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_aws.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-aws"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_bolt.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-bolt"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_firestore.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-firestore"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_googlecloud.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-googlecloud"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_http.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-http"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_io.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-io"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_kafka.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-kafka"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_nats.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-nats"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_redisstream.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "main"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-redisstream"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_sql.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Detail
            
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-sql"
      + sha                 = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by @roblaszczak*